import 'package:flutter/material.dart';

class sp
{
  static List img=["love.jpg","mornig.jpg","night0.jpg",
    "hate.jpg","insp.jpg","political.jpg",
    "sharabi.jpg","funny.jpg","friend.jpg",
    "desh.jpg","atitude.jpg","birth.jpg","death.jpg",
    "emotional.jpg","festi.jpg"
  ];
  static List tital=[
    "Love Shyri",
    "Mornig Shyri",
    "Night shyri",
    "Break-up Shyri",
    "Insperation Shyri",
    "Political Shyri",
    " Sharabi Shyri",
    "Funny Shyri",
    "Friends Shyri",
    "Desh-Bhakti Shyri",
    "Atitude Shyri",
    "Birth-Day Shyri",
    "Death Shyri",
    "Emotional Shyri",
    "Festival Shyri"

  ];
  // shyri data
  static List Loveshyri= [//1
    "आँख खुलते ही तेरी शक्ल याद आ जाती है, "
        "दिन की ये पहली खुशी भी कमाल होती है।",
    "दिल की हर धड़कन बस तेरी है,"
        "नहीं चाहिए सारे जहां की खुशियां मुझे,"
        "खुदा करे तुझे मिल जाए,"
        "वह सारी खुशियां जो मेरी है।",
    "ख्वाहिश इतनी है कि कुछ"
        "ऐसा मेरे नसीब में हो,"
        "वक्त चाहे जैसा भी हो,"
        "बस तू मेरे करीब हो।",
    "मेरे आँखों के ख्वाब, दिल के अरमान हो तुम,"
        "तुम से ही तो मैं हूँ, मेरी पहचान हो तुम,"
        "मैं ज़मीन हूँ अगर तो मेरे आसमान हो तुम,"
        "सच मानो मेरे लिए तो सारा जहान हो तुम।",
    "तुम मेरे वो पल हो जिसका मुझे हर पल इंतजार रहता है।",
    "तुम मेरे वो पल हो जिसका मुझे हर पल इंतजार रहता है।",

    "आँख खुलते ही तेरी शक्ल याद आ जाती है, दिन की ये पहली खुशी भी कमाल होती है।",

    "तू मेरा वह पल है जिस पल का इंतजार मुझे हर पल है।",

    "मैं तुमसे प्यार करता हूँ, चिंता मत करो, नाराजगी हो सकती है, लेकिन नफरत कभी नहीं होगी।",

    "रोज़ क़दम भटकते हैं क़दम तेरे पास आने को, जाने कितने फासले अभी तय करने हैं तुझे पाने के लिए।",
  ];
  static List mornigshyri=[
    //2
    "इन आंखों में जो तस्वीर है वो तेरी है"
        "दिल की हर धड़कन बस तेरी है,"
        "नहीं चाहिए सारे जहां की खुशियां मुझे,"
        "खुदा करे तुझे मिल जाए,"
        "वह सारी खुशियां जो मेरी है।",
    "ख्वाहिश इतनी है कि कुछ"
        "ऐसा मेरे नसीब में हो,"
        "वक्त चाहे जैसा भी हो,"
        "बस तू मेरे करीब हो।",
    "मेरे आँखों के ख्वाब, दिल के अरमान हो तुम,"
        "तुम से ही तो मैं हूँ, मेरी पहचान हो तुम,"
        "मैं ज़मीन हूँ अगर तो मेरे आसमान हो तुम,"
        "सच मानो मेरे लिए तो सारा जहान हो तुम।",
    "मेरे मोहल्ले 🏢के लोगो ने!!"
        "मुझे 🤶एक नया नाम दे दिया!!"
        "मेरा 👯‍♂️साथ देकर आपने!!"
        "ज़िन्दगी ज़ीने का नया 🏢मुकाम दे दिया!!"
        "🌞GOOD MORNING 🌞",

    "सुबह🌙 की किरने हमेशा आपके🤶 साथ हो!!"
        "ज़िन्दगी 👰का हर एक पल 🤶आपके लिए खास हो!!"
        "रूह से दुआ 🙏निकलती हैं आपके👰 लिए !!"
        "संसार की हर खुशिया 👨‍👩‍👧‍👦आपके पास हो!!"
        "🌞 GOOD MORNING 🌞",

    "जंग में हारा हुआ🤶 योद्धा फिर से जंग को जीत सकता है!!"
        "पर अपने मन से हारा हुआ🧖‍♂️ इंसान कोई भी जंग नही जीत सकता!!"
        "इंसान का आत्मविश्वास ही उसकी सर्वश्रेष्ठ पूँजी है!!"
        "🌞 GOOD MORNING 🌞",

    "न तो किसी भाव 🤓में जियो!!"
        "न ही किसी 🌅ताओ में जियो!!"
        "ज़िन्दगी 🧖‍♂️आपकी हैं भाई!!"
        "अपने 👰मस्त स्वभाव में जियो!!"
        "🌞GOOD MORNING🌞",

    "सुबह🌙 की किरने हमेशा आपके🤶 साथ हो!!"
        "ज़िन्दगी 👰का हर एक पल 🤶आपके लिए खास हो!!"
        "रूह से दुआ 🙏निकलती हैं आपके👰 लिए !!"
        "संसार की हर खुशिया 👨‍👩‍👧‍👦आपके पास हो!!"
        "🌞 GOOD MORNING 🌞",


  ];
  static List nightshyri= [
    //3
    "mohabbat meñ nahīñ hai farq jiine aur marne kā"
        "usī ko dekh kar jiite haiñ jis kāfir pe dam nikle" ,

    "hazāroñ ḳhvāhisheñ aisī ki har ḳhvāhish pe dam nikle"
        "bahut nikle mire armān lekin phir bhī kam nikl",

    "un ke dekhe se jo aa jaatī hai muñh par raunaq"
        "vo samajhte haiñ ki bīmār kā haal achchhā hai"
  ];
  static List Breakupeshyri= [ //4

    "भाड़ में जाये लोग ओर,"
        "लोगो की बातें,"
        "हम वैसे ही जियेंगे,"
        "जैसे हम है चाहते..",
    "अब न रिप्लाई चाहिए,"
        "न ही तेरा साथ,"
        "तू प्लीज अपना ध्यान रख,"
        "मुझे नही करनी तुझसे बात…",
    "जो चली गई थी"
        "वो लौट आई है,"
        "स्वागत करो बेटा,"
        "दरवाजे पर तेरी मौत आई है।",
    "दिल के टुकड़े रखे थे # सम्भाल कर एक"
        "टुकड़ा ना # जाने कहां खो गया। ",

    "दिल आज उसकी बात किए बगैर ही सो गया"
        "और खुदाने मेरे हाथो में मोहब्बत की लकीर ही नहीं बनाई थी",

    "तू था त तो सुकून था जिंदगी को"
        "तू नहीं तो जिंदगी से बेजार हुआ हूं।"

  ];
  static List Insperation= [
    //5
    "मंजिलें क्या है, रास्ता क्या है? जिंदगी जियो इस कदर कि मिसाल बन जाए।"
        " रब पर रखो भरोसा वक्त पर एतबार करो।"
        " सच कहता हूं दोस्तों, कुंडली के सितारे भी अपनी जगह बदल देते हैं।",

    "“संघर्ष में आदमी अकेला होता है"
        "सफलता में दुनिया उसके साथ होती है”",

    "“तजुर्बा बता रहा हूँ दोस्त"
        "दर्द,ग़म,डर जो भी है बस तेरे अंदर है"
        "खुद के बनाए पिंजरे से निकल के देख"
        "तू भी एक सिकंदर है”"
  ];
  static List politicalshyri=[
    //6
    "Where was it decided that the lamp for each house,"
        "where there is no lamp for the city ",

    "kutcha houses which were burnt in the riots,"
        "It is a pity that his name was among the rebels.",

    "soldiers will be killed in war,"
        "Surkharu district will be Elahi"
  ];
  static List SharabiShyri=[
    //7
    "शराब और मेरा कई बार ब्रेकअप हो चुका है,"
        "पर कमबख्त हर बार मुझे मना लेती है।",

    "जाम पीने का मजा जिंदगी जीने से जादा हैं,"
        "अगर इसे न पिया तो जिंदगी जीने का मजा क्या हैं !",

    "कुछ तो शराफत सीख ले ए इश्क शराब से,"
        "बोतल पे लिखा तो है मैं जान लेवा हूँ !"
  ];
  static List funnyshyri=[
    //8
    "इस दुनिया में लाखों लोग रहते हैं,"
        "कोई हँसता है तो कोई रोता है,"
        "पर सबसे सुखी वही होता है,"
        "जो शाम को दो पैग मार के सोता है।",

    "न वफ़ा का ज़िक्र होगा,"
        "न वफ़ा की बात होगी,"
        "अब मोहब्बत जिस से भी होगी,"
        "राखी के बाद होगी।",


    "जब कोई ज़िन्दगी में बहुत ख़ास बन जाए,"
        "उसके बारे में सोचना ही उसका एहसास बन जाए,"
        "तो मांग लेना खुदा से उसे जिंदगी भर के लिए,"
        "इस से पहले की उसकी माँ किसी और की सास बन जाए।"
  ];
  static List friendsShyri=[
    //9
    "कोशिश करो कोई आपसे ना रूठे",
    "जिंदगी में अपनों का साथ ना छूटे,"
        "दोस्ती कोई भी हो उसे ऐसा निभाओ,"
        "कि उस दोस्ती की डोर जिंदगी भर ना टूटे।",


    "एक अलग पहचान बनाने की आदत है हमें,"
        "ज़ख्म हो जितने उतना मुस्कुराने की आदत है हमें,"
        "सब कुछ लुटा देते हैं दोस्ती में,"
        "क्यों कि दोस्ती निभाने की आदत है हमें।",

    "गम को बेचकर खुशी खरीद लेंगे,"
        "ख्वाबो को बेचकर जिन्दगी खरीद लेंगे ,"
        "होगा इम्तहान तो देखेगी दुनिया,"
        "खुद को बेचकर आपकी दोस्ती खरीद लेंगे।"

  ];
  static List deshbhaktiShyri=[
    //10
    "कर जस्बे को बुलंद जवान"
        "तेरे पीछे खड़ी आवाम"
        "हर पत्ते को मार गिरायेंगे"
        "जो हमसे देश बटवायेंगे।",

    "जन्नत से बढकर वतन कर ले"
        "जय हिंद जय हिंद, वंदेमातरम्"
        "अमर शहीदों को नमन कर ले।",

    "मेरा दिल मेरी धड़कन मेरी जान हो तुम"
        "अब तो मेरे वजूद की पहचान हो तुम"
        "ए मेरे भारत देश महान हो तुम महान हो तुम।"
  ];
  static List Atittudeshyri= [//11


    "शरीफ़ थे तो नहीं बोले, अगर थोड़े भी बेशर्म होते…बराबर की टक्कर देते",

    "चाँद हो या सूरज, चमकते सब हैं अपना वक़्त आने पर",

    "शायद मै इसलिए पीछे हूँ, मुझे होशियारी नही आती!! बेशक लोग ना समझे मेरी वफादारी, मगर मुझे गद्दारी नहीं आती..",

    "मैं तो वक़्त से हारकर सर झुकाये खड़ा था और सामने खड़े लोग खुदको बादशाह समझने लगें!!",

    "सर से लेकर पैर तक ताकत लगा लेना. साजिशें अगर मेरे खिलाफ़ हुई तो बीमा अपना भी करवा लेना!!"
  ];
  static List birthdayshyri=[
    //12

    "जन्मदिन के ये ख़ास लम्हें मुबारक, आँखों में बसे नए ख्वाब मुबारक,"
        " जिंदगी जो लेकर आई है आपके लिए आज… वो तमाम खुशियों की हंसीं सौगात मुबारक….!!!",

    "हर दिन से प्यारा लगता है हमें ये ख़ास दिन, हम जिसे बिताना नहीं चाहते आप बिन, "
        "वैसे तो दिल देता है सदा ही दुआ आपको फिर भी कहते है मुबारक हो जन्मदिन आपको.!" ,

    "दुआ मांगते है ये भगवान से अपनी सारी खुशी देते है आपको इनाम के रूप मे सब सपने पुरे हो "
        "आपके और आपकी खुशी कभी आपसे दूर ना हो जन्मदिन मुबारक हो !!" ,
  ];
  static List deathshyri= [
    //13

    "तुम्हें याद न आये तो चले आना मेरी मौत पर, उस दिन तो बेगाने भी चले आते हैं । "
        "मेरे खुदा ने ही मुझे मौत दे दी ! पर काश उसने जिन्दा न जलाया होता !",

    "आज कल के लोगों को "
        "एक दिन की"
        "मौत नहीं बल्कि पल-पल"
        "की मौत आती है",

    "तुम्हारी जुदाई में हमें"
        "इतना मरने से डर नहीं लगता"
        "जितना जीने से लग रहा है"
  ];
  static List Emotionalshyri=[
    //14
    "  प्यार ने हमें शायर बना दिया ,"
        "इश्क़ पर शायरी करना सिखा दिया . "
        " बिना किसी Fees बिना किसी College के,"
        "  प्यार के Subject का Master बना दिया।",

    "किसी के प्रभाव में आकर"

        "अपना अच्छा स्वभाव मत छोड़ना",

    "तुम मौसम की तरह बदल गए"
        "और मैं फसलों की "
        "तरह बर्बाद हो गया"
  ];
  static List festivalShyri=[
    //15
    "गुलाल का रंग, गुब्बारों की मार,"
        "सूरज की किरणे,खुशियों की बहार",
    "चाँद की चांदनी, अपनों का प्यार,"
        "मुबारक हो आपको रंगों का त्यौहार.",

    "वसंत ऋतु की बहार,"
        "चली पिचकारी उड़ा है गुलाल,"
        "रंग बरसे नीले हरे लाल,"
        "मुबारक हो आपको होली का त्यौहार",

    "होली के इस पर्व पर"
        "लगे रंग हर गाल"
        "राष्ट्र रंग सब में रमे"
        "हर घर हो खुशहाल"

  ];
  //eMOJI DATA
  static List emoji= [
    "😞 😔 😟 😕 🙁",
    "🤕 🤑 🤠 😈 👿",
    "😤 😠 😡 🤬 🤯",
    "😼 😽 🙀 😿 😾",
    "👨‍❤️‍👨 👩‍❤️‍👨",
    "👨‍❤️‍👨 👩‍❤️‍👨 👩‍❤️‍💋‍👩 💏 👨‍❤️‍💋‍👨",
    "🩲 🩳 👙 👚 👛",
    "🧢 ⛑ 🪖 💄 💍 💼",
    "👳🏻‍♀️ 👳🏻 👳🏻‍♂️ 🧕🏻 👮🏻‍♀️ 👮🏻",
    " 👨🏻‍🌾 👩🏻‍🍳 🧑🏻‍🍳 👨🏻‍🍳 👩🏻‍🎓 ",
    "🧑🏼 👨🏼 👩🏼‍🦱 🧑🏼‍🦱 👨🏼‍🦱",
    "👩‍❤‍💋‍👩 💏 👨‍❤‍💋‍👨",
    "🐴 🦄 🐝 🪱 🐛 🦋",
    "🦗 🕷 🕸 🦂 🐢",
    "🐡 🐠 🐟 🐬 🐳",
    "〽️ ⚠️ 🚸 🔱 ⚜️ 🔰 ♻️ ✅ 🈯️ 💹 ❇️",


  ];
  //COLOR DATA
  static List mycolor= [
    Colors.amber,
    Colors.green,
    Colors.pink,
    Colors.blue,
    Colors.indigo,
    Colors.teal,
    Colors.red,
    Colors.blueGrey,
    Colors.purpleAccent,
    Colors.orange,
    Colors.greenAccent,
    Colors.brown,
    Colors.amber,
    Colors.green,
    Colors.pink,
    Colors.blue,
    Colors.indigo,
    Colors.teal,
    Colors.red,
    Colors.blueGrey,
    Colors.purpleAccent,
    Colors.orange,
    Colors.greenAccent,
    Colors.brown,
    Colors.amber,
    Colors.green,
    Colors.pink,
    Colors.blue,
    Colors.indigo,
    Colors.teal,
    Colors.red,
    Colors.blueGrey,
    Colors.purpleAccent,
    Colors.orange,
    Colors.greenAccent,
    Colors.brown,
    Colors.amber,
    Colors.green,
    Colors.pink,
    Colors.blue,
    Colors.indigo,
    Colors.teal,
    Colors.red,
    Colors.blueGrey,
    Colors.purpleAccent,
    Colors.orange,
    Colors.greenAccent,
    Colors.brown,

    Colors.red,
    Colors.blueGrey,
    Colors.purpleAccent,
    Colors.orange,
    Colors.greenAccent,
    Colors.brown



  ];

}
